---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsReferenceFreesize
source: html/927b0c5e-6f73-6214-7223-fdc07739d1d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsReferenceFreesize Property

"Free Size"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsReferenceFreesize { get; }
```